{
  "backend/main.mo": "Main actor handling user profiles with access control plus restaurant profile, menu, and gallery storage and admin‑gated mutation APIs.",
  "backend/migration.mo": "Migration module that rebuilds menu categories and items with predefined data while preserving structural fields for actor upgrade.",
  "feature_evidence.json": "Feature evidence report listing two menu‑related features, their affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Reference list summarizing all frontend files and their roles in navigation, sections, admin tools, and styling.",
  "frontend/index.css": "Tailwind‑based global styles defining OKLCH color tokens and theme variables for light and dark modes.",
  "frontend/index.html": "HTML bootstrap file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top‑level React component controlling navigation between sections and showing profile setup for new authenticated users.",
  "frontend/src/components/admin/AdminGate.tsx": "Authorization wrapper that blocks non‑admins or unauthenticated users from accessing admin content.",
  "frontend/src/components/admin/AdminPanel.tsx": "Admin dashboard with tabs for editing restaurant profile, menu, and gallery content, protected by AdminGate.",
  "frontend/src/components/admin/GalleryEditor.tsx": "Provides an interface to view, add, edit, and delete gallery image metadata with dialogs and image cards.",
  "frontend/src/components/admin/MenuEditor.tsx": "Manages menu categories and items, allowing creation, editing, and deletion through dialogs and category/item cards.",
  "frontend/src/components/admin/RestaurantProfileEditor.tsx": "Displays and updates the restaurant profile, including name, description, owner, phone, and address fields.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button using Internet Identity with loading and error handling states.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "A dialog prompting new users to enter and save their name to complete profile setup.",
  "frontend/src/components/layout/Footer.tsx": "Simple footer displaying attribution and a link to caffeine.ai.",
  "frontend/src/components/layout/TopNav.tsx": "Responsive top navigation bar with public and admin sections, logo, and authentication button.",
  "frontend/src/components/sections/ContactSection.tsx": "Displays contact information including owner details and phone number with a call button when available.",
  "frontend/src/components/sections/GallerySection.tsx": "Displays a gallery using backend images or defaults, with a lightbox dialog and loading state.",
  "frontend/src/components/sections/LocationSection.tsx": "Shows restaurant location details, Google Maps link, and handles loading state.",
  "frontend/src/components/sections/MenuSection.tsx": "Renders menu categories and items with search, using backend data or seed fallback and loading handling.",
  "frontend/src/components/sections/OverviewSection.tsx": "Provides a hero banner and feature cards describing the restaurant, based on profile data.",
  "frontend/src/data/menuSeed.ts": "Contains seed menu categories and items used when backend data is unavailable.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, admin status, restaurant profiles, and menu categories via an actor API.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light/dark themes using a warm earthy palette.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers and loads global styles.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters and sessionStorage-backed values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, sizing, fonts, and animations using OKLCH variables and plugins.",
  "project_state.json": "Stores project metadata, feature definitions, architectural notes, and known issues for the app."
}