{
  "kind": "build_request",
  "title": "Remove Breakfast from the Menu",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the Breakfast category and all Breakfast items from the seed (fallback) menu data so Breakfast never appears when the backend menu is empty.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "remove the breakfast from the menu"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/data/menuSeed.ts` no longer contains a category named \"BREAKFAST\".",
        "`frontend/src/data/menuSeed.ts` no longer contains any items that were under the Breakfast category (e.g., Paratha, Halwa Puri).",
        "When the backend returns no menu data (categories/items arrays are empty), the Menu section renders without any Breakfast category or items."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the public Menu section does not display Breakfast even if a Breakfast category/items exist in backend data (e.g., legacy/admin-created). Filter out any category named \"BREAKFAST\" (case-insensitive) and any items belonging to that category before rendering.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "remove the breakfast from the menu"
        ]
      },
      "acceptanceCriteria": [
        "If the backend returns a category with name \"BREAKFAST\" (any casing), it is not rendered in the Menu section.",
        "Items belonging to the filtered Breakfast category are not shown in search results or under any category cards.",
        "No empty category cards appear as a result of filtering."
      ]
    },
    {
      "id": "REQ-3",
      "text": "When an admin deletes a menu category, also delete all menu items that belong to that category in the backend so removing Breakfast fully removes its items as well.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "remove the breakfast from the menu"
        ]
      },
      "acceptanceCriteria": [
        "Calling `deleteMenuCategory(categoryId)` removes the category and all menu items whose `categoryId` matches the deleted category.",
        "After deleting a category, subsequent calls to `getMenuItemsByCategory(deletedCategoryId)` return an empty array.",
        "Frontend admin warning text (“All items in it will also be deleted.”) matches actual backend behavior."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo`.",
    "Do not modify files under `frontend/src/components/ui` or other immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new menu categories or items beyond removing Breakfast.",
    "Changing the restaurant profile, location, gallery, or authentication behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}