{
  "kind": "build_request",
  "title": "Update displayed restaurant location to “Jandi Mor, GT road, Gujar Khan, Punjab, Pakistan”",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Location section so the primary address text shown to users is exactly: \"Jandi Mor, GT road, Gujar Khan, Punjab, Pakistan\" (including when restaurant profile data is unavailable).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "totally change the location and write Jandi Mor, GT road, Gujar Khan, Punjab, Pakistan"
        ]
      },
      "acceptanceCriteria": [
        "When the restaurant profile query has no address data, the Location page displays exactly \"Jandi Mor, GT road, Gujar Khan, Punjab, Pakistan\" as the main address line.",
        "When the restaurant profile has address data, the Location page’s main address line renders as \"{street}, {city}, {region}, {country}\" and matches \"Jandi Mor, GT road, Gujar Khan, Punjab, Pakistan\" given the updated default profile values.",
        "The Location section does not show a duplicated \"Gujar Khan\" across its address-related lines (main address + helper text)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the backend default restaurant profile address fields so that the structured address renders as \"Jandi Mor, GT road, Gujar Khan, Punjab, Pakistan\" without repeating \"Gujar Khan\" in the street field.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "totally change the location and write Jandi Mor, GT road, Gujar Khan, Punjab, Pakistan"
        ]
      },
      "acceptanceCriteria": [
        "In backend/main.mo, the defaultAddress values are updated to: street=\"Jandi Mor, GT road\", city=\"Gujar Khan\", region=\"Punjab\", country=\"Pakistan\" (postalCode can remain unchanged).",
        "Calling getRestaurantProfile() on a fresh deployment returns an address that the frontend renders as \"Jandi Mor, GT road, Gujar Khan, Punjab, Pakistan\"."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not modify any files under frontend/src/components/ui or any other frontend immutablePaths.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Do not add new authentication methods or third-party integrations.",
    "Do not redesign unrelated sections (menu, gallery, contact) beyond what is necessary to keep the location/address consistent."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}