{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove Breakfast from public Menu (seed + backend filtering)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove the Breakfast category and its items from the seed (fallback) menu so it never appears when backend menu data is empty.",
      "acceptanceCriteria": [
        "`frontend/src/data/menuSeed.ts` no longer contains a category named \"BREAKFAST\".",
        "`frontend/src/data/menuSeed.ts` no longer contains any items that were under the Breakfast category (e.g., Paratha, Halwa Puri).",
        "When the backend returns no menu data (categories/items arrays are empty), the Menu section renders without any Breakfast category or items."
      ],
      "file_operations": [
        {
          "path": "frontend/src/data/menuSeed.ts",
          "operation": "modify",
          "description": "Delete the seed category named \"BREAKFAST\" and remove all seed items that belonged to that category (including items like Paratha and Halwa Puri) so seed fallback data cannot render Breakfast."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Filter out any Breakfast category/items from backend-provided menu data before search and rendering in the public Menu section.",
      "acceptanceCriteria": [
        "If the backend returns a category with name \"BREAKFAST\" (any casing), it is not rendered in the Menu section.",
        "Items belonging to the filtered Breakfast category are not shown in search results or under any category cards.",
        "No empty category cards appear as a result of filtering."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/MenuSection.tsx",
          "operation": "modify",
          "description": "Add a case-insensitive \"BREAKFAST\" exclusion step for public menu rendering: compute the set of excluded category IDs by filtering categories whose name matches \"BREAKFAST\" (any casing), then filter categories and items to remove that category and any items whose categoryId is excluded before applying search and building categoriesWithItems; ensure the existing empty-category removal still prevents blank cards."
        }
      ]
    }
  ]
}